//--створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

const  array1 = [75, 58, 589, 21, 4]
const  array2 = ['This', 'is', 'my', 'first', 'program']
const  array3 = [false, 365, true, 245, 'program']

console.log(array3);

//=====================================================================================================================

//Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

const array4 = []
array4[0] = 25
array4[3] = true
array4[4] = 'hello'
array4[5] = 895
array4[7] = false
array4[8] = 65

console.log(array4);