//Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3) {
    console.log('The array is large with 3 ond more elements')
}
else console.log('The array is small with less than 3 elements')

//====================================================================================================================

//Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 29
let b = 25
let c = 22

if ((a > b && a < c) || (a < b && a > c)) {
    console.log(`${a} is a middle number of numbers ${b} and ${c}. Number ${a} is between numbers ${b} and ${c}`)
}
else if ((b > a && b < c) || (b > c && b < a)) {
    console.log(`${b} is a middle number of numbers ${a} and ${c}. Number ${a} is not between numbers ${b} and ${c}`)
}
else console.log(`${c} is a middle number of numbers ${a} and ${b}. Number ${a} is not between numbers ${b} and ${c}`)

//====================================================================================================================

//Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }

const x = 2
const y = 5

let result

(x + y < 4) ? result = 'Мало' : result = 'Багато'

console.log(result);

//====================================================================================================================

//Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

const num = 45
let res

(num < 0 && num > -100) ? res =`${num} is negative` : (num === 0) ? res = `${num} is zero` : res = `${num} is positive`

console.log(res);

//====================================================================================================================

//У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

const test = true

if (test) {
    console.log('Вірно');
}
else console.log('Невірно');

test ? console.log('Вірно') : console.log('Невірно')

//====================================================================================================================

//Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let quest = prompt('Яка «офіційна» назва JavaScript?')

//quest === 'ECMAScript' ? console.log('Правильно!') : console.log('Не знаєте? ECMAScript!')

if (quest === 'ECMAScript') {
    console.log('Правильно!')
}
else console.log('Не знаєте? ECMAScript!')

//====================================================================================================================

//У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

const numb = 29

if (numb >= 1 && numb <= 20) {
    console.log('The flat from the first entrance')
}
else if (numb > 20 && numb <= 48) {
    console.log('The flat from the second entrance')
}
else if (numb > 48 && numb <= 90) {
    console.log('The flat from the third entrance')
}
else console.log('The is no flat with this number')

//====================================================================================================================

// Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

const number = 12

number === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО')

//====================================================================================================================

//Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

const temp = 21;

(temp >= 10 && temp <= 22) ? console.log('Ми йдемо ВЧИТИСЯ') : console.log('Вчимося ОНЛАЙН')

//====================================================================================================================

//За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне

const winNumb = +prompt('Enter the number from 1 to 5:')

switch (winNumb) {
    case 1: console.log('You won a car')
        break
    case 2: console.log('You won a bike')
        break
    case 3: console.log('You won a phone')
        break
    case 4: console.log('You won a billion')
        break
    case 5: console.log('You won a house')
        break
    default: console.log('You number is wrong')
}























